# загружаем нужные пакеты
library(languageR)
library(ggplot2)

# загружаем датасет
meta <- oldFrenchMeta

# допишите ваш код ниже
# постройте в ggplot столбиковую диаграмму (_bar), 
# показывающую распределение произведений по темам; цветом-заливкой закодируйте жанр; 
meta |> 
  # ваш код здесь
  # уберите названия осей; добавьте заголовок "Old French Data"
  # ваш код здесь 
  # поверните координатную ось; 
  # ваш код здесь
  # поменяйте тему оформления на черно-белую (bw) 

# !!!! сохраните график как объект в окружении под именем g
# !!!!вызов class(g) должен возвращать "gg"     "ggplot"
